In [2]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.random(size=(5,3))

df = pd.DataFrame(data= data, columns =["A", "B", "C"])

print(df)

          A         B         C
0  0.394881  0.588346  0.406797
1  0.790880  0.643025  0.751401
2  0.370082  0.484351  0.391595
3  0.716228  0.057205  0.097019
4  0.333766  0.313091  0.445404

In [4]:
df1= pd.DataFrame(data= {"A": [1,2,3], "B": [4,5,6], "C": [7,8,9]})

df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [5]:
df2= pd.DataFrame(data= {"A": [1,2,3], "B": ["sam", "alex", "John"]})
df2

   A     B
0  1   sam
1  2  alex
2  3  John

In [7]:
df3 = pd.DataFrame(np.random.random(size = (10000, 4)), columns = ["A", "B", "C", "D"])
df3

             A         B         C         D
0     0.948679  0.108141  0.271869  0.687834
1     0.803409  0.956001  0.040274  0.718496
2     0.841529  0.511667  0.341586  0.691737
3     0.578217  0.869395  0.399660  0.393505
4     0.109064  0.092793  0.209514  0.610143
...        ...       ...       ...       ...
9995  0.249814  0.307021  0.920697  0.584090
9996  0.506251  0.889897  0.654165  0.152028
9997  0.117394  0.851032  0.519543  0.761188
9998  0.837032  0.026079  0.240367  0.819051
9999  0.314873  0.711318  0.234841  0.158984

[10000 rows x 4 columns]

In [12]:
df3.to_csv("random_numbers.csv", index=False, float_format="%0.4f")